# GetPriority Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSupport..::..GetPriority Method
AnalyticalModelSupport Class See Also
---
Retrieves the priority of the support provided.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalyticalSupportPriority GetPriority()
```

Visual Basic
---
```text
Public Function GetPriority As AnalyticalSupportPriority
```

Visual C++
---
```text
public:
AnalyticalSupportPriority GetPriority()
```

# ### Return Value
Indicates the support priority, as determined by Analytical Support Checking
# See Also
AnalyticalModelSupport Class
Autodesk.Revit.DB.Structure Namespace